---
kind: type
id: T:Autodesk.Revit.Exceptions.InvalidPathArgumentException
source: html/3f3c93a6-008b-f9de-40d4-5cd99bb32b34.htm
---
# Autodesk.Revit.Exceptions.InvalidPathArgumentException

The exception that is thrown when a method received a pathname as an argument, but the pathname is
illegal: too long, invalid characters, etc.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class InvalidPathArgumentException : ArgumentException
```